In [2]:
# Real-World Project: Student Report Generator – Read CSV of student marks, calculate grades, and save new CSV.

In [4]:
import pandas as pd
import numpy as np

In [10]:
# Reading CSV
Marks=pd.read_csv("marksheet.csv")
Marks.head()

   id     Name  Gender  Age Section  Science  English  History  Maths
0   1  Bronnie  Female   13       C       21       81       62     49
1   2   Lemmie    Male   15       B       29       41       17     40
2   3    Danya  Female   14       C       12       87       16     96
3   4    Denna  Female   14       B       15       53       82     33
4   5  Jocelin    Male   14       A       43        6        3     21

In [51]:
# Calculating Average marks of students 
Marks["Avg_scores"]=(Marks["Science"]+Marks["English"]+Marks["History"]+Marks["Maths"])/4
Marks

,id,Name,Gender,Age,Section,Science,English,History,Maths,Avg_scores,Grades
0,1,Bronnie,Female,13,C,21,81,62,49,53.25,B
1,2,Lemmie,Male,15,B,29,41,17,40,31.75,C
2,3,Danya,Female,14,C,12,87,16,96,52.75,B
3,4,Denna,Female,14,B,15,53,82,33,45.75,B
4,5,Jocelin,Male,14,A,43,6,3,21,18.25,C
...,...,...,...,...,...,...,...,...,...,...,...
245,246,Nickie,Male,13,C,28,15,25,10,19.50,C
246,247,Rog,Female,13,B,1,4,68,65,34.50,C
247,248,Kaia,Male,15,B,93,48,82,44,66.75,A
248,249,Anni,Female,14,B,35,73,66,59,58.25,B
249,250,Fernande,Male,15,B,50,8,80,78,54.00,B

In [43]:
# Assigning grades based on average marks of students
def grade(x):
    if x >= 60 and x < 100:
        return "A"
    elif x >= 40 and x < 60:
        return "B"
    else:
        return "C"

Marks["Grades"] = Marks["Avg_scores"].apply(grade)
Marks.head()

,id,Name,Gender,Age,Section,Science,English,History,Maths,Avg_scores,Grades
0,1,Bronnie,Female,13,C,21,81,62,49,53.25,B
1,2,Lemmie,Male,15,B,29,41,17,40,31.75,C
2,3,Danya,Female,14,C,12,87,16,96,52.75,B
3,4,Denna,Female,14,B,15,53,82,33,45.75,B
4,5,Jocelin,Male,14,A,43,6,3,21,18.25,C

In [45]:
Marks

,id,Name,Gender,Age,Section,Science,English,History,Maths,Avg_scores,Grades
0,1,Bronnie,Female,13,C,21,81,62,49,53.25,B
1,2,Lemmie,Male,15,B,29,41,17,40,31.75,C
2,3,Danya,Female,14,C,12,87,16,96,52.75,B
3,4,Denna,Female,14,B,15,53,82,33,45.75,B
4,5,Jocelin,Male,14,A,43,6,3,21,18.25,C
...,...,...,...,...,...,...,...,...,...,...,...
245,246,Nickie,Male,13,C,28,15,25,10,19.50,C
246,247,Rog,Female,13,B,1,4,68,65,34.50,C
247,248,Kaia,Male,15,B,93,48,82,44,66.75,A
248,249,Anni,Female,14,B,35,73,66,59,58.25,B
249,250,Fernande,Male,15,B,50,8,80,78,54.00,B

In [48]:
# Saving modified CSV file
Marks.to_csv("updated_students_data.csv", index=False)